Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Copy the raw content from `template.yml <https://github.com/WeblateOrg/openshift/blob/main/template.yml>`_ and import them into your project, then use the :guilabel:`Create` button in the OpenShift web console to create your application. The web console will prompt you for the values for all of the parameters used by the template.
sv: Kopiera det rÃ¥a innehÃ¥llet frÃ¥n `template.yml <https://github.com/WeblateOrg/openshift/blob/main/template.yml>`_ och importera det till ditt projekt. AnvÃ¤nd sedan knappen :guilabel:`Skapa` i OpenShift-webbkonsolen fÃ¶r att skapa din applikation. Webbkonsolen kommer att be dig ange vÃ¤rden fÃ¶r alla parametrar som anvÃ¤nds av mallen.

source: To upload the Weblate template to your current projectâs template library, pass the :file:`template.yml` file with the following command:
sv: FÃ¶r att ladda upp Weblate-mallen till ditt aktuella projekts mallbibliotek, Ã¶verfÃ¶r filen :file:`template.yml` med fÃ¶ljande kommando:

source: The template is now available for selection using the web console or the CLI.
sv: Mallen Ã¤r nu tillgÃ¤nglig fÃ¶r val via webbkonsolen eller CLI.

source: The parameters that you can override are listed in the parameters section of the template. You can list them with the CLI by using the following command and specifying the file to be used:
sv: De parametrar som du kan Ã¥sidosÃ¤tta listas i parametraravsnittet i mallen. Du kan lista dem med CLI genom att anvÃ¤nda fÃ¶ljande kommando och ange vilken fil som ska anvÃ¤ndas:

source: Provisioning
sv: Provisionering

source: You can also use the CLI to process templates and use the configuration that is generated to create objects immediately.
sv: Du kan ocksÃ¥ anvÃ¤nda CLI fÃ¶r att bearbeta mallar och anvÃ¤nda den genererade konfigurationen fÃ¶r att omedelbart skapa objekt.

source: The Weblate instance should be available after successful migration and deployment at the specified ``WEBLATE_SITE_DOMAIN`` parameter.
sv: Weblate-instansen bÃ¶r vara tillgÃ¤nglig efter en lyckad migrering och distribution vid den angivna parametern ``WEBLATE_SITE_DOMAIN``.

source: After container setup, you can sign in as `admin` user with password provided in ``WEBLATE_ADMIN_PASSWORD``, or a random password generated on first start if that was not set.
sv: Efter att containern har konfigurerats kan du logga in som administratÃ¶r med lÃ¶senordet som anges i ``WEBLATE_ADMIN_PASSWORD``, eller ett slumpmÃ¤ssigt lÃ¶senord som genereras vid fÃ¶rsta start om det inte har angetts.

source: To reset `admin` password, restart the container with ``WEBLATE_ADMIN_PASSWORD`` set to new password in the respective ``Secret``.
sv: FÃ¶r att Ã¥terstÃ¤lla `admin`-lÃ¶senordet, starta om behÃ¥llaren med ``WEBLATE_ADMIN_PASSWORD`` instÃ¤llt pÃ¥ det nya lÃ¶senordet i respektive ``Secret``.

source: Eliminate
sv: Eliminera

source: By processing the template a respective ``ConfigMap`` will be created and which can be used to customize the Weblate image. The ``ConfigMap`` is directly mounted as environment variables and triggers a new deployment every time it is changed. For further configuration options, see :ref:`docker-environment` for full list of environment variables.
sv: Genom att bearbeta mallen skapas en respektive ``ConfigMap`` som kan anvÃ¤ndas fÃ¶r att anpassa Weblate-bilden. ``ConfigMap`` monteras direkt som miljÃ¶variabler och utlÃ¶ser en ny distribution varje gÃ¥ng den Ã¤ndras. FÃ¶r ytterligare konfigurationsalternativ, se :ref:`docker-environment` fÃ¶r en fullstÃ¤ndig lista Ã¶ver miljÃ¶variabler.

source: Installing from sources
sv: Installera frÃ¥n kÃ¤llor

source: Please follow the installation instructions for your system first up to installing Weblate:
sv: FÃ¶lj fÃ¶rst installationsanvisningarna fÃ¶r ditt system fram till installationen av Weblate:

source: Grab the latest Weblate sources using Git (or download a tarball and unpack that):
sv: HÃ¤mta de senaste Weblate-kÃ¤llorna med Git (eller ladda ner en tarball och packa upp den):

source: Alternatively you can use released archives. You can download them from our website <https://weblate.org/>. Those downloads are cryptographically signed, please see :ref:`verify`.
sv: Alternativt kan du anvÃ¤nda slÃ¤ppta arkiv. Du kan ladda ner dem frÃ¥n vÃ¥r webbplats <https://weblate.org/>. Dessa nedladdningar Ã¤r kryptografiskt signerade, se :ref:`verify`.

source: Install current Weblate code into the virtualenv:
sv: Installera aktuell Weblate-kod i virtualenv:

source: Copy :file:`weblate/settings_example.py` to :file:`weblate/settings.py`.
sv: Kopiera :file:`weblate/settings_example.py` till :file:`weblate/settings.py`.

source: Adjust the values in the new :file:`settings.py` file to your liking. You will need to provide at least the database credentials and Django secret key, but you will want more changes for production setup, see :ref:`configuration`.
sv: Justera vÃ¤rdena i den nya filen :file:`settings.py` efter eget tycke. Du mÃ¥ste ange Ã¥tminstone databasens inloggningsuppgifter och Djangos hemliga nyckel, men du kommer att behÃ¶va gÃ¶ra fler Ã¤ndringar fÃ¶r produktionskonfigurationen, se :ref:`configuration`.

source: Create the database used by Weblate, see :ref:`database-setup`.
sv: Skapa databasen som anvÃ¤nds av Weblate, se :ref:`database-setup`.

source: Build Django tables, static files and initial data (see :ref:`tables-setup` and :ref:`static-files`):
sv: Skapa Django-tabeller, statiska filer och initiala data (se :ref:`tables-setup` och :ref:`static-files`):

source: This step should be repeated whenever you update the repository.
sv: Detta steg bÃ¶r upprepas varje gÃ¥ng du uppdaterar arkivet.

source: After installation
sv: Efter installationen

source: Congratulations, your Weblate server is now running and you can start using it.
sv: Grattis, din Weblate-server Ã¤r nu igÃ¥ng och du kan bÃ¶rja anvÃ¤nda den.

source: You can now access Weblate on ``http://localhost:8000/``.
sv: Du kan nu komma Ã¥t Weblate pÃ¥ ``http://localhost:8000/``.

source: Sign in with admin credentials obtained during installation or register with new users.
sv: Logga in med administratÃ¶rsuppgifter som erhÃ¥llits under installationen eller registrera dig med nya anvÃ¤ndare.

source: You can now run Weblate commands using :command:`weblate` command when Weblate virtualenv is active, see :ref:`manage`.
sv: Du kan nu kÃ¶ra Weblate-kommandon med kommandot :command:`weblate` nÃ¤r Weblate virtualenv Ã¤r aktivt, se :ref:`manage`.

source: You can stop the test server with :kbd:`Ctrl+C`.
sv: Du kan stoppa testservern med :kbd:`Ctrl+C`.

source: Review potential issues with your installation either on ``/manage/performance/`` URL (see :ref:`manage-performance`) or using :command:`weblate check --deploy`, see :ref:`production`.
sv: Granska eventuella problem med din installation antingen pÃ¥ URL:en ``/manage/performance/`` (se :ref:`manage-performance`) eller med hjÃ¤lp av :command:`weblate check --deploy`, se :ref:`production`.

source: Adding translation
sv: LÃ¤gg till Ã¶versÃ¤ttning

source: Open the admin interface (``http://localhost:8000/create/project/``) and create the project you want to translate. See :ref:`project` for more details.
sv: Ãppna administratÃ¶rsgrÃ¤nssnittet (``http://localhost:8000/create/project/``) och skapa det projekt du vill Ã¶versÃ¤tta. Se :ref:`project` fÃ¶r mer information.

source: All you need to specify here is the project name and its website.
sv: Allt du behÃ¶ver ange hÃ¤r Ã¤r projektets namn och dess webbplats.

source: Create a component which is the real object for translation - it points to the VCS repository, and selects which files to translate. See :ref:`component` for more details.
sv: Skapa en komponent som Ã¤r det verkliga objektet fÃ¶r Ã¶versÃ¤ttning â den pekar pÃ¥ VCS-arkivet och vÃ¤ljer vilka filer som ska Ã¶versÃ¤ttas. Se :ref:`component` fÃ¶r mer information.

source: The important fields here are: :ref:`component-name`, :ref:`component-repo`, and :ref:`component-filemask` for finding translatable files. Weblate supports a wide range of formats including :ref:`gettext`, :ref:`aresource`, :ref:`apple`, :ref:`javaprop`, :ref:`stringsdict` or :ref:`fluent`, see :ref:`formats` for more details.
sv: De viktiga fÃ¤lten hÃ¤r Ã¤r: :ref:`component-name`, :ref:`component-repo` och :ref:`component-filemask` fÃ¶r att hitta Ã¶versÃ¤ttningsbara filer. Weblate stÃ¶der ett brett utbud av format, inklusive :ref:`gettext`, :ref:`aresource`, :ref:`apple`, :ref:`javaprop`, :ref:`stringsdict` eller :ref:`fluent`. Se :ref:`formats` fÃ¶r mer information.

source: Once the above is completed (it can be lengthy process depending on the size of your VCS repository, and number of messages to translate), you can start translating.
sv: NÃ¤r ovanstÃ¥ende Ã¤r klart (det kan ta lÃ¥ng tid beroende pÃ¥ storleken pÃ¥ ditt VCS-arkiv och antalet meddelanden som ska Ã¶versÃ¤ttas) kan du bÃ¶rja Ã¶versÃ¤tta.

source: Configuring Weblate
sv: Konfigurera Weblate

source: The following assumes the virtualenv used by Weblate is activated (by executing ``. ~/weblate-env/bin/activate``). If not, specify the full path to the :command:`weblate` command as ``~/weblate-env/bin/weblate``.
sv: FÃ¶ljande fÃ¶rutsÃ¤tter att virtualenv som anvÃ¤nds av Weblate Ã¤r aktiverat (genom att kÃ¶ra ``. ~/weblate-env/bin/activate``). Om inte, ange den fullstÃ¤ndiga sÃ¶kvÃ¤gen till kommandot :command:`weblate` som ``~/weblate-env/bin/weblate``.

source: Copy the file :file:`~/weblate-env/lib/python3.9/site-packages/weblate/settings_example.py` to :file:`~/weblate-env/lib/python3.9/site-packages/weblate/settings.py`.
sv: Kopiera filen :file:`~/weblate-env/lib/python3.9/site-packages/weblate/settings_example.py` till :file:`~/weblate-env/lib/python3.9/site-packages/weblate/settings.py`.

source: Create the database and its structure for Weblate (the example settings use PostgreSQL, check :ref:`database-setup` for a production-ready setup):
sv: Skapa databasen och dess struktur fÃ¶r Weblate (exempelinstÃ¤llningarna anvÃ¤nder PostgreSQL, se :ref:`database-setup` fÃ¶r en produktionsklar installation):

source: Create an administrator user account ``admin``, generate its password, and copy it to the clipboard; remember to save it for later use:
sv: Skapa ett administratÃ¶rskonto med namnet ``admin``, generera ett lÃ¶senord och kopiera det till urklipp. Kom ihÃ¥g att spara det fÃ¶r senare anvÃ¤ndning:

source: If you previously missed/lost the admin password, you can generate a new one with the following command:
sv: Om du tidigare har tappat bort/glÃ¶mt administratÃ¶rslÃ¶senordet kan du skapa ett nytt med fÃ¶ljande kommando:

source: Collect the static files for your web server (see :ref:`server` and :ref:`static-files`):
sv: Samla in de statiska filerna fÃ¶r din webbserver (se :ref:`server` och :ref:`static-files`):

source: Compress the JavaScript and CSS files (optional, see :ref:`production-compress`):
sv: Komprimera JavaScript- och CSS-filerna (valfritt, se :ref:`production-compress`):

source: Start the Celery workers. This is not necessary for development purposes, but strongly recommended otherwise. :ref:`celery` has more info:
sv: Starta Celery-arbetarna. Detta Ã¤r inte nÃ¶dvÃ¤ndigt fÃ¶r utvecklingsÃ¤ndamÃ¥l, men rekommenderas starkt i Ã¶vriga fall. :ref:`celery` har mer information:

source: Start the development server (:ref:`server` details a production setup):
sv: Starta utvecklingsservern (:ref:`server` beskriver en produktionskonfiguration):

source: Python modules
sv: Python-moduler

source: We're using virtualenv to install Weblate in a separate environment from your system. If you are not familiar with it, check virtualenv :doc:`venv:user_guide`.
sv: Vi anvÃ¤nder virtualenv fÃ¶r att installera Weblate i en separat miljÃ¶ frÃ¥n ditt system. Om du inte Ã¤r bekant med det, kolla in virtualenv :doc:`venv:user_guide`.

source: Create the virtualenv for Weblate:
sv: Skapa virtualenv fÃ¶r Weblate:

source: Activate the virtualenv for Weblate:
sv: Aktivera virtualenv fÃ¶r Weblate:

source: Install Weblate including all optional dependencies:
sv: Installera Weblate inklusive alla valfria beroenden:

source: Please check :ref:`python-deps` for fine-tuning of optional dependencies.
sv: Se :ref:`python-deps` fÃ¶r finjustering av valfria beroenden.

source: :ref:`troubleshoot-pip-install` describes frequent issues while installing Python dependencies.
sv: :ref:`troubleshoot-pip-install` beskriver vanliga problem vid installation av Python-beroenden.

source: System requirements
sv: Systemkrav

source: Install the dependencies needed to build the Python modules (see :ref:`requirements`):
sv: Installera de beroenden som behÃ¶vs fÃ¶r att bygga Python-modulerna (se :ref:`requirements`):

source: Install wanted optional dependencies depending on features you intend to use (see :ref:`python-deps`):
sv: Installera Ã¶nskade valfria beroenden beroende pÃ¥ vilka funktioner du avser att anvÃ¤nda (se :ref:`python-deps`):

source: Optionally install software for running production server, see :ref:`server`, :ref:`database-setup`, :ref:`celery`. Depending on size of your installation you might want to run these components on dedicated servers.
sv: Installera valfritt programvara fÃ¶r att kÃ¶ra produktionsservern, se :ref:`server`, :ref:`database-setup`, :ref:`celery`. Beroende pÃ¥ storleken pÃ¥ din installation kanske du vill kÃ¶ra dessa komponenter pÃ¥ dedikerade servrar.

source: The local installation instructions:
sv: Lokala installationsanvisningar:

source: uv package manager
sv: uv-pakethanterare

source: We're using uv package manager to install Weblate.
sv: Vi anvÃ¤nder uv package manager fÃ¶r att installera Weblate.

source: `Installing uv <https://docs.astral.sh/uv/getting-started/installation/>`_
sv: `Installera uv <https://docs.astral.sh/uv/getting-started/installation/>`_

source: Installing on Debian and Ubuntu
sv: Installation pÃ¥ Debian och Ubuntu

source: Older distributions do not have ``libgirepository-2.0-dev``, use ``libgirepository1.0-dev`` instead. See also :ref:`troubleshoot-pip-install`.
sv: Ãldre distributioner har inte ``libgirepository-2.0-dev``, anvÃ¤nd istÃ¤llet ``libgirepository1.0-dev``. Se Ã¤ven :ref:`troubleshoot-pip-install`.

source: Installing on macOS
sv: Installera pÃ¥ macOS

source: Installing on RedHat, Fedora and CentOS
sv: Installation pÃ¥ RedHat, Fedora och CentOS

source: Installing on SUSE and openSUSE
sv: Installation pÃ¥ SUSE och openSUSE

source: Language definitions
sv: SprÃ¥kliga definitioner

source: To present different translations properly, info about language name, text direction, plural definitions and language code is needed.
sv: FÃ¶r att kunna presentera olika Ã¶versÃ¤ttningar pÃ¥ ett korrekt sÃ¤tt behÃ¶vs information om sprÃ¥knamn, textriktning, pluraldefinitioner och sprÃ¥kkod.

source: Built-in language definitions
sv: Inbyggda sprÃ¥ldefinitioner

source: Definitions for about 800 languages are included in Weblate and the list is extended in every release. Whenever Weblate is upgraded (more specifically whenever :wladmin:`migrate` is executed, see :ref:`generic-upgrade-instructions`) the database of languages is updated to include all language definitions shipped in Weblate.
sv: Definitioner fÃ¶r cirka 800 sprÃ¥k ingÃ¥r i Weblate och listan utÃ¶kas i varje release. Varje gÃ¥ng Weblate uppgraderas (mer specifikt varje gÃ¥ng :wladmin:`migrate` kÃ¶rs, se :ref:`generic-upgrade-instructions`) uppdateras sprÃ¥kdatabasen sÃ¥ att den innehÃ¥ller alla sprÃ¥kteckningar som finns i Weblate.

source: This feature can be disabled using :setting:`UPDATE_LANGUAGES`. You can also enforce updating the database to match Weblate built-in data using :wladmin:`setuplang`.
sv: Denna funktion kan inaktiveras med :setting:`UPDATE_LANGUAGES`. Du kan ocksÃ¥ tvinga fram en uppdatering av databasen sÃ¥ att den matchar Weblates inbyggda data med :wladmin:`setuplang`.

source: `Current language definitions <https://github.com/WeblateOrg/language-data/blob/main/languages.csv>`_
sv: `Aktuella sprÃ¥ldefinitioner <https://github.com/WeblateOrg/language-data/blob/main/languages.csv>`_

source: Parsing language codes
sv: Analysera sprÃ¥kkoder

source: While parsing translations, Weblate attempts to map language code (usually the ISO 639-1 one) from the :ref:`component-filemask` to any existing language object.
sv: NÃ¤r Weblate analyserar Ã¶versÃ¤ttningar fÃ¶rsÃ¶ker det mappa sprÃ¥kkoden (vanligtvis ISO 639-1) frÃ¥n :ref:`component-filemask` till ett befintligt sprÃ¥kojekt.

source: You can further adjust this mapping at project level by :ref:`project-language_aliases`.
sv: Du kan justera denna mappning ytterligare pÃ¥ projektnivÃ¥ genom :ref:`project-language_aliases`.

source: If no exact match can be found, an attempt will be made to best fit it into an existing language. Following steps are tried:
sv: Om ingen exakt matchning kan hittas, kommer ett fÃ¶rsÃ¶k att gÃ¶ras fÃ¶r att bÃ¤st anpassa det till ett befintligt sprÃ¥k. FÃ¶ljande steg fÃ¶rsÃ¶ks:

source: Case insensitive lookups.
sv: SÃ¶kningar som inte Ã¤r skiftlÃ¤geskÃ¤nsliga.

source: Normalizing underscores and dashes.
sv: Normalisering av understrykningstecken och bindestreck.

source: Looking up built-in language aliases.
sv: SÃ¶ka efter inbyggda sprÃ¥kalias.

source: Looking up by language name.
sv: SÃ¶kning efter sprÃ¥knamn.

source: Ignoring the default country code for a given languageâchoosing ``cs`` instead of ``cs_CZ``.
sv: Ignorera standardlandskoden fÃ¶r ett visst sprÃ¥k â vÃ¤lj ``cs`` istÃ¤llet fÃ¶r ``cs_CZ``.

source: Should that also fail, a new language definition will be created using the defaults (left to right text direction, one plural). The automatically created language with code ``xx_XX`` will be named as :guilabel:`xx_XX (generated)`. You might want to change this in the admin interface later, (see :ref:`changing-languages`) and report it to the issue tracker (see :ref:`contributing`), so that the proper definition can be added to the upcoming Weblate release.
sv: Om Ã¤ven det misslyckas skapas en ny sprÃ¥kteckning med standardinstÃ¤llningarna (textriktning frÃ¥n vÃ¤nster till hÃ¶ger, en pluralform). Det automatiskt skapade sprÃ¥ket med koden ``xx_XX`` kommer att namnges :guilabel:`xx_XX (genererat)`. Du kanske vill Ã¤ndra detta senare i administratÃ¶rsgrÃ¤nssnittet (se :ref:`changing-languages`) och rapportera det till felrapporteringssystemet (se :ref:`contributing`), sÃ¥ att rÃ¤tt definition kan lÃ¤ggas till i nÃ¤sta version av Weblate.

source: In case you see something unwanted as a language, you might want to adjust :ref:`component-language_regex` to ignore such file when parsing translations.
sv: Om du ser nÃ¥got oÃ¶nskat som sprÃ¥k kan du justera :ref:`component-language_regex` fÃ¶r att ignorera sÃ¥dana filer nÃ¤r Ã¶versÃ¤ttningar analyseras.

source: Changing language definitions
sv: Ãndra sprÃ¥kinstÃ¤llningar

source: You can change language definitions in the languages interface (:file:`/languages/` URL).
sv: Du kan Ã¤ndra sprÃ¥kteckningar i sprÃ¥kgrÃ¤nssnittet (:file:`/languages/` URL).

source: While editing, ensure all fields are correct (especially plurals and text direction), otherwise translators will be unable to properly edit those translations.
sv: Se till att alla fÃ¤lt Ã¤r korrekta nÃ¤r du redigerar (sÃ¤rskilt pluralformer och textriktning), annars kan Ã¶versÃ¤ttarna inte redigera Ã¶versÃ¤ttningarna pÃ¥ rÃ¤tt sÃ¤tt.

source: Please consider contributing your changes back, see :ref:`extending-languages`.
sv: VÃ¤nligen Ã¶vervÃ¤g att bidra med dina Ã¤ndringar, se :ref:`extending-languages`.

source: Ambiguous language codes and macrolanguages
sv: Tvetydiga sprÃ¥kkoder och makrosprÃ¥k

source: In many cases it is not a good idea to use macrolanguage code for a translation. The typical problematic case might be Kurdish language, which might be written in Arabic or Latin script, depending on actual variant. To get correct behavior in Weblate, it is recommended to use individual language codes only and avoid macrolanguages.
sv: I mÃ¥nga fall Ã¤r det inte en bra idÃ© att anvÃ¤nda makrosprÃ¥kkoder fÃ¶r Ã¶versÃ¤ttning. Ett typiskt problematiskt fall Ã¤r kurdiska sprÃ¥ket, som kan skrivas med arabiska eller latinska bokstÃ¤ver, beroende pÃ¥ den aktuella varianten. FÃ¶r att fÃ¥ korrekt funktion i Weblate rekommenderas att endast anvÃ¤nda enskilda sprÃ¥kkoder och undvika makrosprÃ¥k.

source: `Macrolanguages at Wikipedia <https://en.wikipedia.org/wiki/ISO_639_macrolanguage>`_
sv: `MakrosprÃ¥k pÃ¥ Wikipedia <https://en.wikipedia.org/wiki/ISO_639_macrolanguage>`_

source: Each language consists of following fields:
sv: Varje sprÃ¥k bestÃ¥r av fÃ¶ljande fÃ¤lt:

source: Code identifying the language. Weblate prefers two letter codes as defined by `ISO 639-1 <https://en.wikipedia.org/wiki/ISO_639-1>`_, but uses `ISO 639-2 <https://en.wikipedia.org/wiki/ISO_639-2>`_ or `ISO 639-3 <https://en.wikipedia.org/wiki/ISO_639-3>`_ codes for languages that do not have two letter code. It can also support extended codes as defined by `BCP 47`_.
sv: Kod som identifierar sprÃ¥ket. Weblate fÃ¶redrar tvÃ¥bokstavskoder enligt definitionen i `ISO 639-1 <https://en.wikipedia.org/wiki/ISO_639-1>`_, men anvÃ¤nder `ISO 639-2 <https://en.wikipedia.org/wiki/ISO_639-2>`_ eller `ISO 639-3 <https://en.wikipedia.org/wiki/ISO_639-3>`_ fÃ¶r sprÃ¥k som inte har tvÃ¥bokstavskoder. Det kan ocksÃ¥ stÃ¶dja utÃ¶kade koder enligt definitionen i `BCP 47`_.

source: Visible name of the language. The language names included in Weblate are also being localized depending on user interface language.
sv: Synligt namn pÃ¥ sprÃ¥ket. SprÃ¥knamnen som ingÃ¥r i Weblate lokaliseras ocksÃ¥ beroende pÃ¥ sprÃ¥ket i anvÃ¤ndargrÃ¤nssnittet.

source: Determines whether language is written right to left or left to right. This property is autodetected correctly for most of the languages.
sv: AvgÃ¶r om sprÃ¥ket skrivs frÃ¥n hÃ¶ger till vÃ¤nster eller frÃ¥n vÃ¤nster till hÃ¶ger. Denna egenskap detekteras automatiskt korrekt fÃ¶r de flesta sprÃ¥k.

source: Number of worldwide speakers of this language.
sv: Antal talare av detta sprÃ¥k vÃ¤rlden Ã¶ver.

source: Plural definitions
sv: Pluraldefinitioner

source: Weblate comes with a built-in set of plural definitions. These are based on file-format specifications, CLDR, and other sources.
sv: Weblate har en inbyggd uppsÃ¤ttning pluraldefinitioner. Dessa baseras pÃ¥ filformatspecifikationer, CLDR och andra kÃ¤llor.

source: Doing changes to the built-in plural definitions will most likely won't have desired effect, as these rules need to match underlying implementation.
sv: Att gÃ¶ra Ã¤ndringar i de inbyggda pluraldefinitionerna kommer sannolikt inte att ge Ã¶nskad effekt, eftersom dessa regler mÃ¥ste stÃ¤mma Ã¶verens med den underliggande implementeringen.

source: Changing plural number or formula will affect only displaying of the strings, but not parsing and storing strings to the files. Should you think Weblate behaves incorrectly, please file a issue in our issue tracker.
sv: Ãndring av pluralform eller formel pÃ¥verkar endast visningen av strÃ¤ngarna, men inte tolkningen och lagringen av strÃ¤ngarna i filerna. Om du anser att Weblate fungerar felaktigt, vÃ¤nligen rapportera problemet i vÃ¥r felrapporteringssystem.

source: Plural number
sv: Plural

source: Number of plurals used in the language.
sv: Antal pluralformer som anvÃ¤nds i sprÃ¥ket.

source: Gettext compatible plural formula used to determine which plural form is used for given count.
sv: Gettext-kompatibel pluralformel som anvÃ¤nds fÃ¶r att avgÃ¶ra vilken pluralform som ska anvÃ¤ndas fÃ¶r ett givet antal.

source: `Additional functions for plural forms in GNU gettext`_
sv: `Ytterligare funktioner fÃ¶r pluralformer i GNU gettext`_

source: `Language Plural Rules by the Unicode Consortium`_
sv: `SprÃ¥kliga pluralregler enligt Unicode Consortium`_
